tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "tcnksm/license"
brew "fasd"
brew "fzf"
brew "git"
brew "hub"
brew "jq"
brew "openssl"
brew "mas"
brew "memcached", restart_service: true
brew "node@10", link: true
brew "python"
brew "pyenv"
brew "pyenv-virtualenv"
brew "redis", restart_service: true
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "tcnksm/license/license"
cask "alfred"
cask "docker"
cask "font-source-code-pro"
cask "font-d2coding"
cask "google-chrome"
cask "iterm2"
cask "karabiner"
cask "keepingyouawake"
cask "slack"
cask "spectacle"
cask "typora"
cask "vanilla"
mas "Movist", id: 461788075
mas "Kakaotalk", id: 869223134
mas "BatteryIndicator", id: 1236050766
