# Get brew cask for apps
tap 'caskroom/cask'

#-------------------------------------------------------------------------------
# Applications
#-------------------------------------------------------------------------------

# Configure where our applications go
cask_args appdir: '/Applications'

cask 'alfred'
cask 'boostnote'
cask 'docker'
cask 'evernote'
cask 'firefox'
cask 'google-chrome'
cask 'intellij-idea'
cask 'iterm2'
cask 'karabiner'
cask 'keepingyouawake'
cask 'movist'
cask 'pycharm'
cask 'slack'
cask 'spectacle'
cask 'typora'
cask 'vanilla'

mas 'Battery Indicator', id: 1206020918
mas 'GIPHY CAPTURE', id: 668208984
mas 'Hancom Office Viewer', id: 416746898
mas 'Kakaotalk', id: 869223134
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Todoist', id: 585829637
mas 'TweetDeck', id: 485812721

#-------------------------------------------------------------------------------
# Binaries & Tools
#-------------------------------------------------------------------------------

brew 'git'
brew 'hub'
brew 'heroku-toolbelt'
brew 'mackup'
brew 'mas'
brew 'tmux'
brew 'tree'
brew 'wget'

#-------------------------------------------------------------------------------
# Development
#-------------------------------------------------------------------------------

# Databases
cask 'postgres'
brew 'sqlite'

# Node
brew 'node', args: ['with-full-icu', 'with-npm']

# Python
brew 'python', args:['with-sphinx-doc']
brew 'python3', args:['with-sphinx-doc']

# Ruby
brew 'ruby'
brew 'rbenv'